import math
'''
print('привет мир:)')
1
a=int(input('введите сторону квадрата: '))
P=a*4
print(P)
2
a=int(input('введите сторону квадрата: '))
P=a*a
print(P)

3
a=int(input('введите ширину прямогугольника: '))
d=int(input('введите длинну прямогугольника: '))
P=a*d
print('площадь прямоугольника:',P)
o=(a+d)*2
print('периметр прямоугольника',o)
4
d=int(input('введите диаметр окружности: '))
l=3.14*d
print('площадь окружности:',l)
5
a=int(input('введите ребро куба: '))
P=(a*a)*6
k=a*a*a
print('площадь поверхности куба: ',P)
print('обьем куба: ',k)
7
d=int(input('введите радиус окружности: '))
l=3.14*d*2
i=3.14*(d*d)
print('площадь окружности:',i)
print('длина окружности:',l)

8
d=int(input('введите любое число: '))
a=int(input('введите любое число: '))
f=(a+d)/2
print('среднее орифмитическое',f)
9
d=int(input('введите любое число: '))
a=int(input('введите любое число: '))
f=math.sqrt(a*d)
print('среднее геометрическое:',f)
6
a=int(input('введите ребро прямоугольника: '))
d=int(input('введите ребро прямоугольника: '))
c=int(input('введите ребро прямоугольника: '))
s=2*(a*d+d*c+a*c)
print('площадь поверхности прямоугольника: ',s)
10
d=int(input('введите любое больше 0 число(а): '))
a=int(input('введите любое больше 0 число(d): '))
f=d+a
g=a-d
h=a/d
b=(a*a)*(d*d)
print('сумма,разность,произвидение и частное их квадратов: ',f,',',g,',',h,',',b)
11
d=int(input('введите любое меньше 0 число(а): '))
a=int(input('введите любое меньше 0 число(d): '))
f=d+a
g=a-d
h=a/d
b=(math.fabs(a))*(math.fabs(d))
print('сумма,разность,произвидение и частное их модулей: ',f,',',g,',',h,',',b)
12
d=int(input('введите катет прямоугольного треугольника: '))
a=int(input('введите катет прямоугольного треугольника: '))
g=(d*d)+(a*a)
c=math.sqrt(g)
p=a+d+c
print('периметор и гипатенуза:',p,',',c)
'''
13
d=int(input('введите радиус окружности: '))
a=int(input('введите радиус окружности(меньше чем у преведущего): '))
s1=3.14*(d*d)
s2=3.14*(a*a)
s3=s1*s2
print('',s3)











